// დავალება 1. ინკრემენტი არ იყო დამატებული. დავამატე i++, რომ ყოველი ციკლის დამთავრების შემდეგ, i გაიზარდოს ერთით. 
let i = 1;
let sum = 0;
while(i<10) {
    if (i % 2 != 0) {
    sum = sum + i;
    }
    i++;
}
console.log(sum); 

// დავალება 2.
//ვარიანტი 1. როდესაც ვამოწმებთ i-ს იყოფა თუ არა უნაშთოდ 3-ზე და გაყოფის შემთხვევაში ვუმატებთ sum3 ცვლადში. 
let sum3 = 0;
for (let i = 0; i < 50; i++) {
    if (i % 3 == 0) {
        sum3 += i;
    }
}
console.log(sum3);

//ვარიანტი 2. ინკრემენტს ვიწყებთ 3-დან და ყოველი ციკლის შემდეგ ვზრდით სამით. 
let sumOf3 = 0;
for (let i = 3; i < 50; i+=3) {
    sumOf3 += i;
}
console.log(sumOf3);

//ვარიანტი 3. while ციკლის გამოყენებით.
let SumOf3 = 0;
let j = 1;
while (j<50) {
    if (j % 3 == 0) {
        SumOf3 += j;
    }
    j++;
}
console.log(SumOf3);